/*
Пройдемся по пунктам:
1) В создании объектов сначала создаем ключевые объекты системы: GridBoard, ScoreSession и ConsoleView. По ходу игры будем создавать фишки, наверно, это мог бы делать
и gridBoard, но я вот тут сомневаюсь, нужен ли GemFactory или не выносить это в отдельную сущность. Другие объекты не создаются.
2) Обработка событий идет от ConsoleView, если введенная команда корректна, то она передается дальше вызовом функции у GridBoard, если совпадений нет, то возвращается
начальное состояние и в ConsoleView сообщит об ошибке, иначе запустит процесс очистки от совпадений/создания новых фишек. В этом процессе информация передается в 
ScoreSession, возможно, есть смысл так же хранить номер волны совпадений подряд, чтобы менять от этого множитель для очков.
Процесс очистки совпадений завершается, вызывается сброс множителей, если они как-то зависят от волн в ScoreSession и выводится новое поле и счет для пользователя.
3) Стек чистый C#, System.Console для вывода матрицы(поля), xUnit для тестов.
4) Типовые тестовые сценарии это невалидные данные, неуспешный/успешный ход, какие-то специфичные тесты на ScoreSession, если там сложная логика подсчета, а так же
на разные подтипы Gem, если они включены.
*/
