/*
Получилось достаточно много лишнего, BonusGem убирается за ввод иерархии слишком рано, информацию о бонусе можно хранить и в старшем типе, PatternMatcher уходит 
из самостоятельных АТД, его функции переходят к GridBoard, так как у него только запросы. GravityEngine аналогично уходит в АТД поля, так как не имеет состояния и 
отвечает на вопрос "что делает?". PlayerMove тоже получился избыточным, так как это просто инкапсуляция действия, можно просто превратить в метод swap, вызываемый у 
игровой доски. CellCoordinate тоже просто структура, не имеющая команд, нет смысла выносить так рано из поля в отдельную сущность. 
*/
