/*
Ориентируясь на слова про менеджмент состояний/фабрики объектов, сразу напрашивается 
1) TokenFactory
Инкапсулирует логику случайного распределения цветов и вероятностей появления бонусов, отделяет гровую доску от правила создания новых сущностей.
2) GameEventBroker
Некоторая сущность, которая будет связывать уничтожение фишек с "отрисовкой" и счетчиком очков/концом игры.
3) MatchStateLoop
Машина состояний, которая проверяет, чтобы игрок не мог сделать новый ход, пока не завершатся все последствия предыдущего хода.
4) BonusActivationStrategy
Собственно, реализация паттерна Strategy, для поддержки разных видов бонусов(удаление квадратами разных размеров/крестом/линией/тд).
*/
